OpenFOAM-10/tutorials/combustion/reactingFoam/RAS/membrane/0/include
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "0";
    object      include;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sleeve
{
    CH4 0;
    N2  0.77;
    O2  0.23;
}

pipe
{
    CH4 0.5;
    O2  0;
    N2  0.5;
}


// ************************************************************************* //
